Pandas

In [2]:
import numpy as np

In [6]:
import pandas as pd

In [3]:
labels = ["a", "b", "c"]
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [7]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

The above series method for pandas allows you to use keys of a dictionary as the index and values as the values of a quasi-list

In [9]:
ser1 = pd.Series([1,2,3,4],['USA','USSR','Japan','Latvia'])

In [10]:
ser1

USA       1
USSR      2
Japan     3
Latvia    4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,5,4],['USA','USSR','Italia', 'Khazakstan'])

In [12]:
ser2

USA           1
USSR          2
Italia        5
Khazakstan    4
dtype: int64

In [13]:
ser1['USSR']

2

In [16]:
ser3 = pd.Series(labels)

In [17]:
ser3

0    a
1    b
2    c
dtype: object

In [18]:
ser1 + ser2

Italia        NaN
Japan         NaN
Khazakstan    NaN
Latvia        NaN
USA           2.0
USSR          4.0
dtype: float64

BELOW IS ABOUT DATAFRAMES

In [19]:
from numpy.random import randn

In [20]:
np.random.seed(101)

In [21]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],[0,1,2,3])

In [22]:
df

          0         1         2         3
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [23]:
df[0]

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: 0, dtype: float64

In [26]:
df[[1,3]]

          1         3
a  0.628133  0.503826
b -0.319318  0.605965
c  0.740122 -0.589001
d -0.758872  0.955057
e  1.978757  0.683509

In [27]:
df['new'] = df[0] + df[3]

In [28]:
df

          0         1         2         3       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [29]:
df.drop('a')

          0         1         2         3       new
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [30]:
df

          0         1         2         3       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [34]:
df[df['new'] > 0]

          0         1         2         3       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [35]:
df['new']>0

a     True
b     True
c    False
d     True
e     True
Name: new, dtype: bool

In [36]:
df.drop('a')

          0         1         2         3       new
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [46]:
boolser = df[0]>0
result = df[boolser]
myCols = ['new']
result[myCols]

        new
a  3.210676
b  1.257083
d  1.143752
e  0.874303

In [40]:
result

          0         1         2         3       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

How do you check multiple things in an array?

In [49]:
df[(df[0]>0) & (df['new']>1)]

          0         1         2         3       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
d  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [50]:
newind = 'CA NY WY OR CO'.split()

In [51]:
df['States'] = newind

In [52]:
df

          0         1         2         3       new States
a  2.706850  0.628133  0.907969  0.503826  3.210676     CA
b  0.651118 -0.319318 -0.848077  0.605965  1.257083     NY
c -2.018168  0.740122  0.528813 -0.589001 -2.607169     WY
d  0.188695 -0.758872 -0.933237  0.955057  1.143752     OR
e  0.190794  1.978757  2.605967  0.683509  0.874303     CO

In [53]:
df.set_index('States')

               0         1         2         3       new
States
CA      2.706850  0.628133  0.907969  0.503826  3.210676
NY      0.651118 -0.319318 -0.848077  0.605965  1.257083
WY     -2.018168  0.740122  0.528813 -0.589001 -2.607169
OR      0.188695 -0.758872 -0.933237  0.955057  1.143752
CO      0.190794  1.978757  2.605967  0.683509  0.874303

In [54]:
df.reset_index()

  index         0         1         2         3       new States
0     a  2.706850  0.628133  0.907969  0.503826  3.210676     CA
1     b  0.651118 -0.319318 -0.848077  0.605965  1.257083     NY
2     c -2.018168  0.740122  0.528813 -0.589001 -2.607169     WY
3     d  0.188695 -0.758872 -0.933237  0.955057  1.143752     OR
4     e  0.190794  1.978757  2.605967  0.683509  0.874303     CO

In [55]:
df

          0         1         2         3       new States
a  2.706850  0.628133  0.907969  0.503826  3.210676     CA
b  0.651118 -0.319318 -0.848077  0.605965  1.257083     NY
c -2.018168  0.740122  0.528813 -0.589001 -2.607169     WY
d  0.188695 -0.758872 -0.933237  0.955057  1.143752     OR
e  0.190794  1.978757  2.605967  0.683509  0.874303     CO

# Data Frames â€“ Multi-index

In [59]:
#index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [60]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [61]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [73]:
df.loc['G2'].loc[2,'A']

-0.993263499973366

In [66]:
df.index.names = ['Groups', 'Num']

In [74]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

## Missing Data

In [4]:
d = { 'A':[1,2,np.nan], 'B':[5, np.nan,np.nan],'C':[1,2,3]}

In [5]:
df = pd.DataFrame(d)

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.dropna()
#this will drop any row with null values, axis=1 will drop any column

     A    B  C
0  1.0  5.0  1

In [13]:
df.fillna(value="Fill Value")
#there's a whole rationale for filling unfilled values, and it depends on what type of data you're working with.

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

## groupby

In [14]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [15]:
df2 = pd.DataFrame(data)

In [16]:
df2

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [18]:
byComp = df2.groupby('Company')

In [20]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [25]:
df2.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [35]:
df2.drop(labels="Person", axis=1).groupby('Company').min()

         Sales
Company
FB         243
GOOG       120
MSFT       124

In [38]:
df2.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## Operations!

In [3]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [40]:
df['col2'].nunique()

3

In [41]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [42]:
df[(df['col1']>2) & (df['col2'] > 378)]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [43]:
def times2(x):
    return x*2

In [44]:
times2(4)

8

In [48]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [1]:
pwd

'/Users/Holly/Desktop/NYU Shanghai/NYU Shanghai Year 2/Semester 2/Web Design/GitHub/Notebooks'

In [5]:
pd.read_csv('exa')

<function pandas.io.parsers.read_csv(filepath_or_buffer: Union[str, pathlib.Path, IO[~AnyStr]], sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: str = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)>